Documents/ВыпускОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ВыпускОбучающихся</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АктуальностьКонтингента</xr:Item>
				<xr:Item>AccumulationRegister.ЧисленностьГруппы</xr:Item>
				<xr:Item>AccumulationRegister.АктивныйКонтингент</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обучающиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контингент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийБалл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/АктуальностьКонтингента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>АктуальностьКонтингента</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специальности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДвижениеКонтингента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДвижениеКонтингента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контингент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВыпускОбучающихся/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	// В данном коде необходимо сделать следующее
	//  - получить группу
	//  - получить актуальный список обучающихся на момент создания документа
	//  - по полученному списку получить их оценки по регистру ИтоговыеОценки
	//  - получить средний балл и выложить в столбец
	Объект.Обучающиеся.Очистить();
	ГруппаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГруппаПриИзмененииНаСервере()
	Обучающиеся = РегистрыСведений.АктуальностьКонтингента.СрезПоследних(Объект.Дата);
	Для Каждого Обучающийся из Обучающиеся Цикл
		Если Обучающийся.Группа = Объект.Группа Тогда
			НоваяСтрока = Объект.Обучающиеся.Добавить();
			НоваяСтрока.ФИО = Обучающийся.Обучающийся;
			НоваяСтрока.СреднийБалл = 5;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
